In [30]:
import pandas as pd

In [31]:
df =  pd.read_csv('./titanic.csv')

In [32]:
from sklearn.preprocessing import OneHotEncoder

In [33]:
ohe = OneHotEncoder(sparse_output=False,dtype='int')

In [34]:
df[['female','male']] = ohe.fit_transform(df[['Sex']])

In [35]:
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,female,male
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,0

In [36]:
df.dropna(subset=['Embarked'],inplace=True)

In [37]:
from sklearn.preprocessing import LabelEncoder
labelEnc = LabelEncoder()

In [38]:
embarkedEncoded = labelEnc.fit_transform(df[['Embarked']])
df['embarkedEnc'] = embarkedEncoded

c:\Users\Soham\AppData\Local\Programs\Python\Python313\Lib\site-packages\sklearn\preprocessing\_label.py:110: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

In [39]:
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,female,male,embarkedEnc
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,1,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,0,0

In [40]:
df = df.drop(columns=['Embarked','Sex'])

In [41]:
df.head(2)

,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,female,male,embarkedEnc
0,1,0,3,"Braund, Mr. Owen Harris",22.0,1,0,A/5 21171,7.2500,NaN,0,1,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 17599,71.2833,C85,1,0,0

In [42]:
from sklearn.impute import SimpleImputer

In [43]:
si = SimpleImputer(strategy='mean')

In [44]:
ageImpute = si.fit_transform(df[['Age']])

In [45]:
df['imputeAge'] = ageImpute

In [46]:
df.head(2)

,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,female,male,embarkedEnc,imputeAge
0,1,0,3,"Braund, Mr. Owen Harris",22.0,1,0,A/5 21171,7.2500,NaN,0,1,2,22.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 17599,71.2833,C85,1,0,0,38.0

In [47]:
df = df.drop(columns=['Age'])

In [48]:
df.head(2)

,PassengerId,Survived,Pclass,Name,SibSp,Parch,Ticket,Fare,Cabin,female,male,embarkedEnc,imputeAge
0,1,0,3,"Braund, Mr. Owen Harris",1,0,A/5 21171,7.2500,NaN,0,1,2,22.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,0,PC 17599,71.2833,C85,1,0,0,38.0

In [49]:
df.to_csv('cleanedData.csv')